Friends | List of all members
ACAPI::MEP::CableCarrierSegmentPreferenceTableContainer Class Referencefinal
MEP Element Manager
The CableCarrierSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with cable carriers. More...
#include <MEPCableCarrierSegmentPreferenceTableContainer.hpp>
 Inheritance diagram for ACAPI::MEP::CableCarrierSegmentPreferenceTableContainer:
 Friends
Result< CableCarrierSegmentPreferenceTableContainer >  | GetCableCarrierSegmentPreferenceTableContainer ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::PreferenceTableContainerBase
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::PreferenceTableContainerBase
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl > impl)
Constructs a PreferenceTableContainerBase with the given base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The CableCarrierSegmentPreferenceTableContainer can contain several PreferenceTableBase associated with cable carriers.
Since
Archicad 27
The container is already initialized (but may be empty) and you can access it by calling GetCableCarrierSegmentPreferenceContainer.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Friends And Related Symbol Documentation
◆ GetCableCarrierSegmentPreferenceTableContainer
 Result< CableCarrierSegmentPreferenceTableContainer > GetCableCarrierSegmentPreferenceTableContainer  |  ( |   | )
friend
Returns
If able, returns the CableCarrierPreferenceTableContainer from the project.